IDS_DLG_DPLUS_REINF_TEST_MSG                  = "Test ( DLG_DPLUS_REINF )"

IDC_RFM_SELECT_MEMBER                         = "Select Member"
IDC_RFM_BTN_SELECT_ALL                        = "All"
IDC_RFM_BTN_SELECT_NONE                       = "None"

/////// IDD_UFSL_PMODE_DLG
IDC_UFSL_RMAT_FRM_REIN_TYPE                   = "Reinforce Type"
IDC_UFSL_RMAT_LBL_REIN_TYPE                   = "Type"
IDC_UFSL_RMAT_FRM_MATL_INFO                   = "Material"
IDC_UFSL_RPOS_FRM_EXPO_COND                   = "Exposure Condition"
IDC_UFSL_RPOS_LBL_EXPO_COND                   = "Exposure"
IDC_UFSL_CHECK_RESULT                         = "Check Result"
IDC_UFSL_CHK_RTOP_REIN                        = "Reinforcement( Top )"
IDC_UFSL_LBL_RTOP_SPAC                        = "Space"
IDC_UFSL_LBL_RTOP_SIZE                        = "Size"
IDC_UFSL_LBL_RTOP_NUMB                        = "Pieces"
IDC_UFSL_CHK_RBOT_REIN                        = "Reinforcement( Bottom )"
IDC_UFSL_LBL_RBOT_SPAC                        = "Space"
IDC_UFSL_LBL_RBOT_SIZE                        = "Size"
IDC_UFSL_LBL_RBOT_NUMB                        = "Pieces"
IDC_UFSL_GET_DATA_FROM_RC_SLAB                = "Get Data from RC Slab ..."

/////// IDD_UFSL_COPY_DLG
IDD_UFSL_COPY_DLG                             = "Get Data from RC Slab"
IDS_UFSL_NOT_EXIST_RC_SLAB_DATA               = "RC Slab Data is not Exist."
IDS_UFSL_COPY_DATA_IS_NOT_SELECTED            = "Data Item(s) to Import is not Selected."
IDC_UFSL_COPY_DLG_FRM_SEL_GSLAB               = "Select RC Slab"
IDC_UFSL_COPY_DLG_FRM_COPY_POSI               = "Position"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDI               = "Dir-X ( Top )"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDM               = "Dir-X ( Middle )"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDJ               = "Dir-X ( Bottom )"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDI               = "Dir-Y ( Left )"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDM               = "Dir-Y ( Center )"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDJ               = "Dir-Y ( Right )"
IDC_UFSL_COPY_DLG_RDO_POSI_MAXS               = "Maximum"
IDC_UFSL_COPY_DLG_FRM_SLAB_INFO               = "RC Slab Information"
IDC_UFSL_COPY_DLG_FRM_COPY_DATA               = "Data"
IDC_UFSL_COPY_DLG_CHK_COPY_MATL               = "Material"
IDC_UFSL_COPY_DLG_CHK_COPY_SECT               = "Section"
IDC_UFSL_COPY_DLG_CHK_COPY_RBAR               = "Rebar"
IDC_UFSL_COPY_DLG_CHK_COPY_FORC               = "Forces"

/////// IDD_UFBE_RMAT_DLG
IDC_UFBE_RMAT_FRM_REIN_TYPE                   = "Reinforce Type"
IDC_UFBE_RMAT_LBL_REIN_TYPE                   = "Type"
IDC_UFBE_RMAT_FRM_MATL_INFO                   = "Material"

/////// IDD_UFBE_RPOS_DLG
IDC_UFBE_RPOS_FRM_REIN_PROP                   = "Reinforcement Property"
IDC_UFBE_RPOS_FRM_PROP_SHEA                   = "Shear Reinforcement"
IDC_UFBE_RPOS_LBL_WRAP_TYPE                   = "Type"
IDC_UFBE_RPOS_LBL_SHR_WIDTH                   = "Width"
IDC_UFBE_RPOS_LBL_SHR_SPACE                   = "Space"
IDC_UFBE_RPOS_FRM_EXPO_COND                   = "Exposure Condition"
IDC_UFBE_RPOS_LBL_EXPO_COND                   = "Exposure"
IDC_RFM_TBL_POS_DOT                           = "Pos."
IDC_RFM_TBL_APPLY                             = "Apply"
IDC_RFM_TBL_SIZE                              = "Size"
IDC_RFM_TBL_PIECE                             = "Pieces"

/////// IDD_UFBE_RPOS_LIST_DLG
IDD_UFBE_RPOS_LIST_DLG                        = "Reinforcement Detail"

/////// IDD_UFBE_PMODE_DLG
IDC_UFBE_CHECK_RESULT                         = "Check Result"
IDC_UFBE_GET_DATA_FROM_RC_BEAM                = "Get Data from RC Beam ..."

/////// IDD_UFBE_FORC_DLG
IDC_GUFBE_LABEL_FORCE_MDL                     = "Mux(DL)"
IDC_GUFBE_LABEL_FORCE_MLL                     = "Mux(LL)"
IDC_GUFBE_LABEL_FORCE_MUX                     = "Mux"
IDC_GUFBE_LABEL_FORCE_VUY                     = "Vuy"

/////// IDD_UFBE_SECT_DLG
IDC_URBE_APPLY_SEISMIC_PROVISIONS             = "Apply Seismic Provisions"

/////// IDD_UFBE_COPY_DLG
IDD_UFBE_COPY_DLG                             = "Get Data from RC Beam"
IDC_UFBE_COPY_DLG_FRM_SEL_GURBE               = "Select RC Beam"

IDC_UFBE_COPY_DLG_FRM_COPY_MODE               = "Program Mode"
IDC_UFBE_COPY_DLG_RDO_MODE_PMOD               = "Project Mode"
IDC_UFBE_COPY_DLG_RDO_MODE_SMOD               = "Simple Mode"

IDC_UFBE_COPY_DLG_FRM_COPY_POSI               = "Position"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDI               = "End ( I )"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDM               = "Middle"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDJ               = "End ( J )"
IDC_UFBE_COPY_DLG_RDO_POSI_MAXS               = "Max ( I, M, J )"

IDC_UFBE_COPY_DLG_FRM_COPY_DATA               = "Data"
IDC_UFBE_COPY_DLG_CHK_COPY_MATL               = "Material"
IDC_UFBE_COPY_DLG_CHK_COPY_SECT               = "Section"
IDC_UFBE_COPY_DLG_CHK_COPY_RBAR               = "Rebar"
IDC_UFBE_COPY_DLG_CHK_COPY_FORC               = "Forces"

IDC_UFBE_COPY_DLG_FRM_BEAM_INFO               = "RC Beam Information"

IDS_UFBE_NOT_EXIST_RC_BEAM_DATA               = "RC Beam Data is not Exist."
IDS_UFBE_COPY_DATA_IS_NOT_SELECTED            = "Data Item(s) to Import is not Selected."

/////// IDD_UFCO_PMODE_DLG
IDC_UFCO_BTN_COPY_URCO                        = "Get Data From RC Column ..."
IDC_UFCO_RDO_RESULT_BEFORE                    = "Before"
IDC_UFCO_RDO_RESULT_AFTER                     = "After"
IDC_UFCO_CHK_REIN_SHEAR                       = "Check Shear"

/////// IDD_UFCO_COPY_DLG
IDD_UFCO_COPY_DLG                             = "Get Data from RC Column"
IDC_UFCO_COPY_DLG_FRM_SEL_GURCO               = "Select RC Column"
IDC_UFCO_COPY_DLG_FRM_COPY_DATA               = "Data"
IDS_UFCO_NOT_EXIST_RC_COLUMN_DATA             = "RC Column Data is not Exist."
IDS_UFCO_COPY_DATA_IS_NOT_SELECTED            = "Data Item(s) to Import is not Selected."
